testxml/21.06.08.22.49.41.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body xmlns:ns2="http://interfaces.my/"><ns2:addEmployee><arg0>Rajan</arg0><arg1>IT</arg1><arg2>Developer</arg2><arg3>England</arg3></ns2:addEmployee></S:Body></S:Envelope><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body xmlns:ns2="http://interfaces.my/"><ns2:addEmployeeResponse><addEmployee>1</addEmployee></ns2:addEmployeeResponse></S:Body></S:Envelope>