testxml/21.06.08.22.51.46.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body xmlns:ns2="http://interfaces.my/"><ns2:getAllEmployees/></S:Body></S:Envelope><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body xmlns:ns2="http://interfaces.my/"><ns2:getAllEmployeesResponse><employeeList><country>Canada</country><department>IT</department><empJob>Developer</empJob><empName>Sarbjot</empName><empNo>1</empNo></employeeList><employeeList><country>Canada</country><department>IT</department><empJob>Developer</empJob><empName>Teginder</empName><empNo>2</empNo></employeeList><employeeList><country>Canada</country><department>IT</department><empJob>Developer</empJob><empName>Sumeet</empName><empNo>3</empNo></employeeList><employeeList><country>Canada</country><department>Sales</department><empJob>Pre Sales</empJob><empName>Rameet</empName><empNo>4</empNo></employeeList><employeeList><country>Canada</country><department>HR</department><empJob>Recruiting</empJob><empName>Jashan</empName><empNo>5</empNo></employeeList><employeeList><country>England</country><department>IT</department><empJob>Developer</empJob><empName>David</empName><empNo>6</empNo></employeeList><employeeList><country>England</country><department>IT</department><empJob>Salesforce develoepr</empJob><empName>Sumit</empName><empNo>7</empNo></employeeList><employeeList><country>England</country><department>Hr</department><empJob>Test</empJob><empName>Test</empName><empNo>8</empNo></employeeList><employeeList><country>England</country><department>IT</department><empJob>Developer</empJob><empName>Rajan</empName><empNo>9</empNo></employeeList></ns2:getAllEmployeesResponse></S:Body></S:Envelope>