testxml/21.06.08.22.53.21.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body xmlns:ns2="http://interfaces.my/"><ns2:getEmployeeByID><arg0>1</arg0></ns2:getEmployeeByID></S:Body></S:Envelope><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body xmlns:ns2="http://interfaces.my/"><ns2:getEmployeeByIDResponse><getEmployeeById><country>Canada</country><department>IT</department><empJob>Developer</empJob><empName>Sarbjot</empName><empNo>1</empNo></getEmployeeById></ns2:getEmployeeByIDResponse></S:Body></S:Envelope>